package Commands;

/**
 * The type Help.
 */
public class Help extends CommandWithNoArg {
    @Override
    public String execute(Object o){
        return ("help : вывести справку по доступным командам\n" +
                "info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)\n" +
                "show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении\n" +
                "add {element} : добавить новый элемент в коллекцию\n" +
                "update id {element} : обновить значение элемента коллекции, id которого равен заданному\n" +
                "remove_by_id id : удалить элемент из коллекции по его id\n" +
                "clear : очистить коллекцию\n" +
                "save : сохранить коллекцию в файл\n" +
                "exit : завершить программу (без сохранения в файл)\n" +
                "remove_at index : удалить элемент, находящийся в заданной позиции коллекции (index)\n" +
                "shuffle : перемешать элементы коллекции в случайном порядке\n" +
                "reorder : отсортировать коллекцию в порядке, обратном нынешнему\n" +
                "average_of_telephone_code : вывести среднее значение поля telephoneCode для всех элементов коллекции\n");
    }
    @Override
    public String getName(){return "help";}
}
